app/controllers/tweets_controller.rb

INSERT INTO "tweets" ("body", "created_at", "updated_at", "user_id", "image") VALUES (?, ?, ?, ?, ?)  [["body", "今日もこんなご飯を食べたよ"], ["created_at", "2023-01-13 07:07:42.082910"], ["updated_at", "2023-01-13 07:07:42.082910"], ["user_id", 1], ["image", "線香花火.jpg"]]
---
    def create
        tweet = Tweet.new(tweet_params)
        tweet.user_id = current_user.id
        if tweet.save

SELECT "tweets".* FROM "tweets" WHERE "tweets"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "tweets" WHERE "tweets"."id" = ?  [["id", 3]]
---
      def destroy
        tweet = Tweet.find(params[:id])
        tweet.destroy